# **Pandas 시작하기**

In [1]:
import sys
sys.version

'3.7.4 (default, Aug  9 2019, 18:34:13) [MSC v.1915 64 bit (AMD64)]'

## **Series**

- **1차원구조**
- **numpy array와 마찬가지로 index 이용 가능하며, index를 지정할 수도 있다.**

In [2]:
import pandas as pd
import numpy as np

In [4]:
obj = pd.Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [7]:
obj2 = pd.Series([4,7,-5,3], index = ['d','b','a','c'])

In [8]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [9]:
obj3 = obj.copy()

In [13]:
import string
obj3.index = [i for i in string.ascii_lowercase[:4]]

In [14]:
obj3.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [17]:
obj2[['c','a','d']]

c    3
a   -5
d    4
dtype: int64

In [26]:
# boolean indexing
obj2[obj2>0]

d    4
b    7
c    3
dtype: int64

In [36]:
obj2 * 2

d     8
b    14
a   -10
c     6
dtype: int64

In [37]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [38]:
enumerate(obj2)

In [39]:
[i for i in enumerate(obj2)]

[(0, 4), (1, 7), (2, -5), (3, 3)]

In [47]:
sdata = {'Ohio' : 35000, 'Texas' : 71000, 'Oregon': 16000, 'Utah' : 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [55]:
sdata2 = {'Ohio' : 35000, 'Texas' : 71000, 'Oregon': 16000, 'Utah' : [5000,6000]}
obj3 = pd.Series(sdata2)
obj3

Ohio             35000
Texas            71000
Oregon           16000
Utah      [5000, 6000]
dtype: object

In [56]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [58]:
# 오름차순 sort_index()
obj2.sort_index()

a   -5
b    7
c    3
d    4
dtype: int64

In [59]:
obj2.sort_index(ascending = False)

d    4
c    3
b    7
a   -5
dtype: int64

# **DataFrame**

In [61]:
test = {'Name' : ['John', 'Anna', 'Peter'],
       'Location' : ['New York', 'Paris', 'Berlin'],
       'Age' : [24,13,45]}

In [63]:
test_pd = pd.DataFrame(test)
test_pd

    Name  Location  Age
0   John  New York   24
1   Anna     Paris   13
2  Peter    Berlin   45

In [64]:
test_pd['Name']

0     John
1     Anna
2    Peter
Name: Name, dtype: object

In [66]:
test_pd[test_pd.Age>15]

    Name  Location  Age
0   John  New York   24
2  Peter    Berlin   45

In [73]:
test_pd[['Name','Age']]

    Name  Age
0   John   24
1   Anna   13
2  Peter   45

In [76]:
test_pd.loc[[0,2]]  # 보이는 index값 그 자체

    Name  Location  Age
0   John  New York   24
2  Peter    Berlin   45

In [77]:
test_pd.iloc[[0,2]]  # index에 숨겨져있는 할당된 값

    Name  Location  Age
0   John  New York   24
2  Peter    Berlin   45

In [78]:
test_pd[(test_pd.Age>15) & (test_pd.Age<40)]

   Name  Location  Age
0  John  New York   24

# **자료의 행수가 맞지 않을 때 데이터프레임화??**

In [108]:
test1 = {'Name' : ['John', 'Anna','Peter','Adam'],
        'Location' : ['New York','Paris','Berlin'],
        'Age' : [24,13,45]}

In [112]:
test_df1 = pd.DataFrame.from_dict(test1, orient = 'index')
test_df1

In [114]:
test_df2 = test_df1.T
test_df2

    Name  Location  Age
0   John  New York   24
1   Anna     Paris   13
2  Peter    Berlin   45
3   Adam       NaN  NaN

## **Column 추출**
- 기본형 : column은 colname으로 / row는 rowname으로
- 그러나 row 추출의 경우 슬라이싱만 가능함

In [116]:
# 1개 Column
test_pd['Name']

0     John
1     Anna
2    Peter
Name: Name, dtype: object

In [117]:
test_pd['Name'][0]+'1'

'John1'

In [118]:
test_pd[['Name']]

    Name
0   John
1   Anna
2  Peter

In [119]:
test_pd['Name'][[0,2]]

0     John
2    Peter
Name: Name, dtype: object

In [122]:
test_pd[['Name']].loc[[0,2]]

    Name
0   John
2  Peter

In [123]:
test_pd1 = test_pd.copy()

In [127]:
test_pd1.index = ['a','b','c']
test_pd1

    Name  Location  Age
a   John  New York   24
b   Anna     Paris   13
c  Peter    Berlin   45

In [128]:
test_pd1.loc[['a','b']]

   Name  Location  Age
a  John  New York   24
b  Anna     Paris   13

In [130]:
test_pd1.iloc[[0,2]]['Name']

a     John
c    Peter
Name: Name, dtype: object

### **더 연습해보기**

In [133]:
data = {'state' : ['Ohio']*3 + ['Nevada']*3,
       'year' : [2000, 2001, 2002, 2001, 2002, 2003],
       'pop' : [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [134]:
frame.tail(3)

    state  year  pop
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [135]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [136]:
frame.info()  ## DataFrame 기본정보

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
state    6 non-null object
year     6 non-null int64
pop      6 non-null float64
dtypes: float64(1), int64(1), object(1)
memory usage: 272.0+ bytes

In [137]:
frame.describe()  ## DataFrame 기본통계량

              year       pop
count     6.000000  6.000000
mean   2001.500000  2.550000
std       1.048809  0.836062
min    2000.000000  1.500000
25%    2001.000000  1.875000
50%    2001.500000  2.650000
75%    2002.000000  3.125000
max    2003.000000  3.600000

In [138]:
frame.describe().loc['std']

year    1.048809
pop     0.836062
Name: std, dtype: float64

In [140]:
# Column 순서 변경
pd.DataFrame(data, columns = ['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [142]:
frame_test = frame[['year','state','pop']]
frame_test

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [169]:
# 없는 Column 추가
frame2 = pd.DataFrame(data, columns = ['year','state','pop','debt'],
                     index = ['one','two','three','four','five','six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [170]:
frame2['debt'] = 16.5

# **특정 Column 추가**

In [171]:
frame2['dept/pop'] = frame2['debt']/frame2['pop']
frame2

       year   state  pop  debt   dept/pop
one    2000    Ohio  1.5  16.5  11.000000
two    2001    Ohio  1.7  16.5   9.705882
three  2002    Ohio  3.6  16.5   4.583333
four   2001  Nevada  2.4  16.5   6.875000
five   2002  Nevada  2.9  16.5   5.689655
six    2003  Nevada  3.2  16.5   5.156250

In [172]:
frame2

       year   state  pop  debt   dept/pop
one    2000    Ohio  1.5  16.5  11.000000
two    2001    Ohio  1.7  16.5   9.705882
three  2002    Ohio  3.6  16.5   4.583333
four   2001  Nevada  2.4  16.5   6.875000
five   2002  Nevada  2.9  16.5   5.689655
six    2003  Nevada  3.2  16.5   5.156250

In [173]:
frame2 = pd.DataFrame(frame2, columns = ['year','state','pop','debt','dept/pop','etc'])

In [174]:
frame2

       year   state  pop  debt   dept/pop  etc
one    2000    Ohio  1.5  16.5  11.000000  NaN
two    2001    Ohio  1.7  16.5   9.705882  NaN
three  2002    Ohio  3.6  16.5   4.583333  NaN
four   2001  Nevada  2.4  16.5   6.875000  NaN
five   2002  Nevada  2.9  16.5   5.689655  NaN
six    2003  Nevada  3.2  16.5   5.156250  NaN

In [176]:
pd.isna(frame2['etc'])

one      True
two      True
three    True
four     True
five     True
six      True
Name: etc, dtype: bool

In [181]:
frame2['etc'] = 50

In [182]:
# 서로 다른 값으로 채워 넣기 --> 행수에 맞는 리스트로 추가
frame2['etc2'] = np.NaN

In [183]:
# 서로 다른 값으로 채워 넣기  --> 행수에 맞는 리스트로 추가
frame2['etc2'] = [i for i in range(12) if i%2==0]

In [184]:
frame2

       year   state  pop  debt   dept/pop  etc  etc2
one    2000    Ohio  1.5  16.5  11.000000   50     0
two    2001    Ohio  1.7  16.5   9.705882   50     2
three  2002    Ohio  3.6  16.5   4.583333   50     4
four   2001  Nevada  2.4  16.5   6.875000   50     6
five   2002  Nevada  2.9  16.5   5.689655   50     8
six    2003  Nevada  3.2  16.5   5.156250   50    10

In [185]:
val = pd.Series([-1.2, -1.5, -1.7], index = ['two','four','five'])

In [186]:
frame2['debt'] = val
frame2

       year   state  pop  debt   dept/pop  etc  etc2
one    2000    Ohio  1.5   NaN  11.000000   50     0
two    2001    Ohio  1.7  -1.2   9.705882   50     2
three  2002    Ohio  3.6   NaN   4.583333   50     4
four   2001  Nevada  2.4  -1.5   6.875000   50     6
five   2002  Nevada  2.9  -1.7   5.689655   50     8
six    2003  Nevada  3.2   NaN   5.156250   50    10

In [187]:
frame2.drop('one')

       year   state  pop  debt  dept/pop  etc  etc2
two    2001    Ohio  1.7  -1.2  9.705882   50     2
three  2002    Ohio  3.6   NaN  4.583333   50     4
four   2001  Nevada  2.4  -1.5  6.875000   50     6
five   2002  Nevada  2.9  -1.7  5.689655   50     8
six    2003  Nevada  3.2   NaN  5.156250   50    10

In [189]:
frame2.drop(['etc','etc2'], axis=1, inplace=True)

In [191]:
frame2.loc['two']

year           2001
state          Ohio
pop             1.7
debt           -1.2
dept/pop    9.70588
Name: two, dtype: object

In [197]:
frame2.reset_index(drop=True)

   year   state  pop  debt   dept/pop
0  2000    Ohio  1.5   NaN  11.000000
1  2001    Ohio  1.7  -1.2   9.705882
2  2002    Ohio  3.6   NaN   4.583333
3  2001  Nevada  2.4  -1.5   6.875000
4  2002  Nevada  2.9  -1.7   5.689655
5  2003  Nevada  3.2   NaN   5.156250

# **월드뱅크 GDP 데이터를 이용해 아래 문제에 해당하는 데이터를 추출해보세요**
### (결과만 데이터프레임 형태로 확인할 수 있게)
## **0. Ranking Column 추가**
## **1. 상위 5개의 국가 Code명과 Ranking Column**
## **2. 중국, 일본, 한국의 Ranking과 GDP Column**
## **3. Ranking이 홀수인 국가들의 Code, Ranking, GDP Column**
## **4. Ranking이 짝수이면서 10위 이하 국가들의 Code, Ranking, GDP Column**

In [312]:
gdp= pd.read_csv('C:/Users/admin/Desktop/210603~/210603/gdp2018_1.csv', sep = ';')

In [275]:
# 0
gdp['GDP']=np.array([int(gdp['GDP'][i].replace(',','')) for i in range(gdp['GDP'].size)])
gdp =gdp.sort_values('GDP', ascending = False)

In [313]:
# 0-2
gdp['GDP']=gdp['GDP'].apply(lambda x:x.replace(',','')).astype(int)
gdp = gdp.sort_values('GDP', ascending = False)

In [315]:

gdp['Ranking'] = np.arange(1,gdp['GDP'].size + 1)

In [336]:
# 1
gdp[:5][['Code','Ranking']]
gdp.head(5)[['Code','Ranking']]

   Code  Ranking
15  CHN        1
3   USA        2
2   IND        3
1   JPN        4
10  DEU        5

In [330]:
# 2
gdp[(gdp['Nation']=='China') | (gdp['Nation']=='Japan') | (gdp['Nation']=='Korea Rep.')] [['Ranking','GDP']]

    Ranking       GDP
15        1  25361744
1         4   5484951
5        14   2090161

In [331]:
# 3
gdp[(gdp['Ranking']%2 == 1)] [['Code','Ranking','GDP']]

   Code  Ranking       GDP
15  CHN        1  25361744
2   IND        3  10498468
10  DEU        5   4505236
16  IDN        7   3494762
0   GBR        9   3074432
7   ITA       11   2542974
9   TUR       13   2372087
17  ESP       15   1908879
19  CAN       17   1774034
12  THA       19   1320373

In [333]:
# 4 
gdp[(gdp['Ranking']%2 == 0) & (gdp['Ranking'] <= 10)] [['Code','Ranking','GDP']]

   Code  Ranking       GDP
3   USA        2  20494100
1   JPN        4   5484951
4   RUS        6   3986064
18  BRA        8   3365757
6   FRA       10   3073179